# LandingDepthIsLessThanRunWidthWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..LandingDepthIsLessThanRunWidthWarning Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Landing depth is less than run width.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LandingDepthIsLessThanRunWidthWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LandingDepthIsLessThanRunWidthWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LandingDepthIsLessThanRunWidthWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace